; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph3 - mode
	spectrograph5 - mode
	image4 - mode
	Star5 - direction
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph5)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument3 image1)
	(supports instrument3 image4)
	(calibration_target instrument3 Star3)
	(supports instrument4 image4)
	(supports instrument4 image0)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star2)
	(supports instrument7 image0)
	(supports instrument7 spectrograph5)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument8 thermograph3)
	(supports instrument8 image4)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument9 image0)
	(calibration_target instrument9 Star4)
	(supports instrument10 image1)
	(supports instrument10 spectrograph5)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument11 image0)
	(calibration_target instrument11 Star3)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 image1)
	(supports instrument12 thermograph3)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star3)
	(calibration_target instrument12 Star1)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite5 Star1)
	(have_image Star6 image4)
	(have_image Star6 spectrograph2)
	(have_image Star7 image0)
	(have_image Star8 thermograph3)
	(have_image Planet9 spectrograph2)
	(have_image Planet9 image0)
	(have_image Planet10 spectrograph5)
	(have_image Planet10 image1)
))

)

; plan
1. (turn_to satellite6 star1 groundstation0)
   deleted: (pointing satellite6 groundstation0)
   added: (pointing satellite6 star1)
   goals met: 0 of 10
2. (switch_on instrument12 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument12)
   goals met: 0 of 10
3. (calibrate satellite6 instrument12 star1)
   added: (calibrated instrument12)
   goals met: 0 of 10
4. (turn_to satellite6 star6 star1)
   deleted: (pointing satellite6 star1)
   added: (pointing satellite6 star6)
   goals met: 0 of 10
5. (take_image satellite6 star6 instrument12 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 1 of 10
6. (turn_to satellite6 planet9 star6)
   deleted: (pointing satellite6 star6)
   added: (pointing satellite6 planet9)
   goals met: 1 of 10
7. (take_image satellite6 planet9 instrument12 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 2 of 10
8. (turn_to satellite6 planet10 planet9)
   deleted: (pointing satellite6 planet9)
   added: (pointing satellite6 planet10)
   goals met: 2 of 10
9. (turn_to satellite5 star1 star5)
   deleted: (pointing satellite5 star5)
   added: (pointing satellite5 star1)
   goals met: 3 of 10
10. (turn_to satellite2 groundstation0 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation0)
   goals met: 3 of 10
11. (turn_to satellite1 star5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star5)
   goals met: 4 of 10
12. (take_image satellite6 planet10 instrument12 image1)
   added: (have_image planet10 image1)
   goals met: 5 of 10
13. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 5 of 10
14. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 5 of 10
15. (turn_to satellite2 planet10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet10)
   goals met: 5 of 10
16. (take_image satellite2 planet10 instrument4 spectrograph5)
   added: (have_image planet10 spectrograph5)
   goals met: 6 of 10
17. (turn_to satellite2 planet9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet9)
   goals met: 6 of 10
18. (take_image satellite2 planet9 instrument4 image0)
   added: (have_image planet9 image0)
   goals met: 7 of 10
19. (turn_to satellite2 star6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star6)
   goals met: 7 of 10
20. (take_image satellite2 star6 instrument4 image4)
   added: (have_image star6 image4)
   goals met: 8 of 10
21. (turn_to satellite2 star7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star7)
   goals met: 8 of 10
22. (take_image satellite2 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 9 of 10
23. (turn_to satellite6 star8 planet10)
   deleted: (pointing satellite6 planet10)
   added: (pointing satellite6 star8)
   goals met: 9 of 10
24. (take_image satellite6 star8 instrument12 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 10 of 10
